Ракович_В_Ю_70189466/src/InformationRegisters/АллергииСтудентов/АллергииСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АллергииСтудентов</name>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтепеньТяжести</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Симптомы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждающийДокумент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аллерген</name>
    <type>
      <types>CatalogRef.Аллергены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Ракович_В_Ю_70189466/src/InformationRegisters/АллергииСтудентов/ManagerModule.bsl
// Проверить аллергию на лекарство
Функция ПроверитьАллергиюНаЛекарство(Студент, Лекарство) Экспорт
    
    // Получаем компоненты лекарства
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    АллергииСтудентов.Аллерген,
    |    АллергииСтудентов.СтепеньТяжести
    |ИЗ
    |    РегистрСведений.АллергииСтудентов КАК АллергииСтудентов
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лекарства.Состав КАК Состав
    |        ПО АллергииСтудентов.Аллерген = Состав.Аллерген
    |ГДЕ
    |    АллергииСтудентов.Студент = &Студент
    |    И АллергииСтудентов.Активна = ИСТИНА
    |    И Состав.Владелец = &Лекарство";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Лекарство", Лекарство);
    
    Результат = Запрос.Выполнить();
    Если Не Результат.Пустой() Тогда
        Возврат Результат.Выгрузить();
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции

// Получить список аллергий студента
Функция ПолучитьАллергииСтудента(Студент) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    АллергииСтудентов.Аллерген.Наименование,
    |    АллергииСтудентов.СтепеньТяжести,
    |    АллергииСтудентов.Симптомы,
    |    АллергииСтудентов.ДатаОбнаружения
    |ИЗ
    |    РегистрСведений.АллергииСтудентов КАК АллергииСтудентов
    |ГДЕ
    |    АллергииСтудентов.Студент = &Студент
    |    И АллергииСтудентов.Активна = ИСТИНА
    |УПОРЯДОЧИТЬ ПО
    |    АллергииСтудентов.СтепеньТяжести УБЫВ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции
